[
  {
    "title": "Diving into Delta Lake Tech Talk Series",
    "description": "Join us for a three-part learning series: Diving Into Delta Lake. This series of tech talks takes you through the internals of Delta Lake, a popular open-source technology enabling ACID transactions, time travel, schema enforcement, and more on top of your data lakes. The Delta Lake engineering team, including Burak Yavuz, Andrea Neumann, Tathagata “TD”.",
    "thumbnail": "./images/tutorials/diving-into-delta-lake.jpg",
    "url": "https://databricks.com/discover/diving-into-delta-lake-talks"
  },
  {
    "title": "Getting Started filling your Delta Lake",
    "description": "The rise of the Lakehouse architectural pattern is built upon tech innovations enabling the data lake to support ACID transactions and other features of traditional data warehouse workloads. Join us for a five-part learning series on Getting Started with Delta Lake. This series of tech talks takes you through the technology foundation of Delta Lake.",
    "thumbnail": "./images/tutorials/get-starting-filling-v2.jpg",
    "url": "https://databricks.com/discover/getting-started-with-delta-lake-tech-talks"
  },
  {
    "title": "Tutorial: How Delta Lake Supercharges Data Lakes",
    "description": "Delta Lake’s transaction log brings high reliability, performance, and ACID compliant transactions to data lakes. But exactly how does it accomplish this? Working through concrete examples, we will take a close look at how the transaction logs are managed and leveraged by Delta to supercharge data lakes.",
    "thumbnail": "./images/tutorials/delta-lake-tutorial.png",
    "url": "https://www.youtube.com/watch?v=u1VfOiHVeMI"
  },
  {
    "title": "Simple, Reliable Upserts and Deletes",
    "description": "We will demonstrate on Apache Spark™ 2.4.3 how to use Python and the Python APIs in Delta Lake 0.4.0 within the context of an on-time flight performance scenario. We will show how to upsert and delete data, query old versions of data with time travel and vacuum older versions for cleanup.",
    "thumbnail": "./images/tutorials/delta-lake-0.4.0-merge-python.png",
    "url": "https://databricks.com/blog/2019/10/03/simple-reliable-upserts-and-deletes-on-delta-lake-tables-using-python-apis.html"
  },
  {
    "title": "Delta Lake Tutorial (SAIS EU 2019)",
    "description": "This tutorial goes through many features of Delta Lake features including schema enforcement and schema evolution, interoperability between batch and streaming workloads, time travel, and DML commands like Delete and Merge. It was originally given at Spark Summit 2019 Europe and is available in both Scala and Python.",
    "thumbnail": "./images/tutorials/Building-Data-Intensive-Analytic-Application-on-Top-of-Delta-Lakes.png",
    "url": "https://github.com/delta-io/delta/tree/master/examples/tutorials/saiseu19"
  },
  {
    "title": "Delta Lake Workshop Primer",
    "description": "This is the notebook primer for the Delta Lake workshop featuring Delta Lake and MLflow. It is also used extensively for the Delta Lake Hands-on Labs.",
    "thumbnail": "./images/tutorials/Delta-Lake-Workshop-Delta-Lake-MLflow-Primer.png",
    "url": "https://pages.databricks.com/rs/094-YMS-629/images/01-Delta%20Lake%20Workshop%20-%20Delta%20Lake%20Primer.html"
  },
  {
    "title": "Delta from a Data Engineer’s Perspective",
    "description": "Take a walk through the daily struggles of a data engineer in this presentation as we cover what is truly needed to create robust end to end Big Data solutions.",
    "thumbnail": "./images/tutorials/Summit-OG-image-min.jpg",
    "url": "https://databricks.com/session_na20/delta-from-a-data-engineers-perspective"
  },
  {
    "title": "Getting Started Guide",
    "description": "This guide helps you quickly explore the main features of Delta Lake. It provides code snippets that show how to read from and write to Delta tables from interactive, batch, and streaming queries.",
    "thumbnail": "./images/tutorials/Quick-Start.png",
    "url": "/learn/getting-started"
  }
]
